# Задача 1. Вариант 12.
# Напишите программу, которая будет сообщать род деятельности и псевдоним

# Manukyan S.E.
# 01.10.16

print ("Мария Луиза Чеччарелли, более известна как актриса Моника Витти.")
input("Введите Enter чтобы закрыть программу")
