# Задача 4. Вариант 12.
# Напишите программу, которая выводит имя, под которым скрывается Лариса Петровна Косач-Квитка 

# Manukyan S.E.
# 01.10.16

print("Лариса Петровна Косач-Квитка,более известна как Леся Украина")
print("Место рождения:Новоград-Волынский,Волынская губерния,Российская империя")
born=int(1871)
death=int(1913)
age=int(death-born)
print("Год рождения:"+str(born))
print ("Возраст:"+str(age))
print ("Область интересов:украинская поэтесса, писательница, переводчица, деятель культуры")
input()
