# Задача 3. Вариант 12.
# Напишите программу, которая выводит имя "Тициано Вечеллио", и запрашивает его псевдоним. 

# Manukyan S.E.
# 01.10.16

print("Введите псевдоним Тициано Вечеллио:") 
RN= "Тициано Вечеллио" 
vopros= input() 
print (RN+" - Это "+vopros) 
input ("Намжите Enter для выхода.")
