# Задача 2. Вариант 12.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание

# Manukyan S.E.
# 01.10.16

print("Для человека мысль-венец всего живого, а чистота души есть бытия основа.")
print("\t\t\t\t Анвари.") 
input("Введите Enter")
